       IDENTIFICATION DIVISION.
       PROGRAM-ID. CA023A11.
      *   PROGRAM NAME: SUB PROGRAM - DISCPAID
      *   INPUT: WS-INCOME
      *   OUTPUT: WS-DISCOUNT, WS-PAID
      *   DESCRIPTION: CALCULATES THE DISCOUNT AND AMOUNT PAID, BASED
      *       ON THE PROVIDED INCOME.
       DATA DIVISION.
       LINKAGE SECTION.
       77 LN-INCOME   PIC 9(06)V9(02).
       77 LN-DISCOUNT PIC 9(06).
       77 LN-PAID     PIC 9(06)V9(02).
       PROCEDURE DIVISION USING LN-INCOME, LN-DISCOUNT, LN-PAID.
       0000-MAIN.
           PERFORM 1000-MAIN-PROC
               THRU 1000-MAIN-PROC-END.
           PERFORM 9000-TERM
               THRU 9000-TERM-END.
       0000-MAIN-END. EXIT.

       1000-MAIN-PROC.
           COMPUTE LN-PAID  = LN-INCOME - ( 0.45 * LN-INCOME )
           COMPUTE LN-DISCOUNT = LN-PAID / 2.
       1000-MAIN-PROC-END. EXIT.

       9000-TERM.
           GOBACK.
       9000-TERM-END. EXIT.       