//ARI011AA JOB NOTIFY=&SYSUID
//****************************************************************
//JOBPROC  JCLLIB ORDER=OZAGS1.USER.PROCLIB
// SET A=CA013A11         CA013A11 , CA023A11
//COBCL    EXEC COBCL
//COMPILE.SYSIN DD DSN=ARI011.KELVIN.ASGMTL2.NOMINEE.PDS(&A.),
//         DISP=SHR
//LKED.SYSLMOD  DD DSN=ARI011.KELVIN.ASGMTL2.NOMINEE.LOADLIB(&A.),
//         DISP=SHR
//COMPILE.SYSLIB DD DSN=ARI011.KELVIN.ASGMTL2.NOMINEE.PDS,DISP=SHR
//