//ARI011AA JOB NOTIFY=&SYSUID
//*
//*   JOB TO PREDELETE THE KSDS AND CREATE A NEW KSDS
//*
//JSTEP001 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  DELETE ARI011.KELVIN.ASGMTL2.NOMINEE.KSDS
  IF LASTCC = 8 THEN SET MAXCC=3

  DEFINE CLUSTER( -
    NAME(ARI011.KELVIN.ASGMTL2.NOMINEE.KSDS) -
    TRACK(3,4) -
    RECORDSIZE(80,80) -
    CONTROLINTERVALSIZE(512) -
    KEYS(5,0) -
    FREESPACE(10,10) -
    INDEXED )
/*
