//ARI011AA  JOB NOTIFY=&SYSUID
// JCLLIB ORDER=ARI011.KELVIN.L0.AGENT.PDS
//JSTEP     EXEC PROC=PA011A11
//PSTEP010.SYSIN DD DSN=ARI011.KELVIN.L0.AGENT.PDS(CA011A11),DISP=SHR
//PSTEP020.SYSIN DD DSN=ARI011.KELVIN.L0.AGENT.PDS(CA021A11),DISP=SHR
//PSTEP030.SYSIN DD DSN=ARI011.KELVIN.L0.AGENT.PDS(CA031A11),DISP=SHR
//PSTEP031.SYSIN DD DSN=ARI011.KELVIN.L0.AGENT.PDS(CA041A11),DISP=SHR
//PSTEP032.SYSIN DD DSN=ARI011.KELVIN.L0.AGENT.PDS(CA041A11),DISP=SHR
//PSTEP043.SYSIN DD DSN=ARI011.KELVIN.L0.AGENT.PDS(CA051A11),DISP=SHR
//SYSIN     DD DUMMY