//ARI011AA JOB NOTIFY=&SYSUID
//* CREATING GDG FOR Q3
//JSTEP01  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=ARI011.KELVIN.L0.AGENT.PDS(CA081A11),DISP=SHR
//* COPYING DATA FROM PS7 INTO MEMBER OF GDG
//JSTEP002 EXEC PGM=IEBGENER
//SYSUT1   DD DSN=ARI011.KELVIN.AGTCMN.PS7,
//            DISP=SHR
//SYSUT2   DD DSN=ARI011.KELVIN.L0.AGENT.BACKUP(+1),
//            DISP=(NEW,CATLG),
//            SPACE=(TRK,(1,1)),
//            DCB=(LRECL=80,BLKSIZE=800,RECFM=FB,DSORG=PS)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DUMMY