  DEFINE AIX( -
  NAME(ARI011.KELVIN.ASGMTL1.SHARE.AIX) -
  RELATE(ARI011.KELVIN.ASGMTL1.SHARE.ESDS) -
  TRACKS(3,4) -
  RECORDSIZE(80,80) -
  KEYS(5,13) -
  FREESPACE(10,10) -
  NONUNIQUEKEY )