//ARI011AA JOB  NOTIFY=&SYSUID
//JSTEP001 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=ARI011.KELVIN.ASGMTL1.SHARE.PDS(CA102A11),DISP=SHR